###############################################################################
# Created by write_sdc
###############################################################################
current_design i2c_master_axil
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i2c_scl_i}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i2c_sda_i}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_araddr[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_araddr[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_araddr[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_araddr[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_arprot[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_arprot[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_arprot[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_arvalid}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_awaddr[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_awaddr[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_awaddr[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_awaddr[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_awprot[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_awprot[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_awprot[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_awvalid}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_bready}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rready}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wdata[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wstrb[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wstrb[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wstrb[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wstrb[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wvalid}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i2c_scl_o}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i2c_scl_t}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i2c_sda_o}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i2c_sda_t}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_arready}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_awready}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_bresp[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_bresp[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_bvalid}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rdata[9]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rresp[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rresp[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_rvalid}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axil_wready}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {i2c_scl_o}]
set_load -pin_load 0.0334 [get_ports {i2c_scl_t}]
set_load -pin_load 0.0334 [get_ports {i2c_sda_o}]
set_load -pin_load 0.0334 [get_ports {i2c_sda_t}]
set_load -pin_load 0.0334 [get_ports {s_axil_arready}]
set_load -pin_load 0.0334 [get_ports {s_axil_awready}]
set_load -pin_load 0.0334 [get_ports {s_axil_bvalid}]
set_load -pin_load 0.0334 [get_ports {s_axil_rvalid}]
set_load -pin_load 0.0334 [get_ports {s_axil_wready}]
set_load -pin_load 0.0334 [get_ports {s_axil_bresp[1]}]
set_load -pin_load 0.0334 [get_ports {s_axil_bresp[0]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[31]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[30]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[29]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[28]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[27]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[26]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[25]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[24]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[23]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[22]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[21]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[20]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[19]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[18]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[17]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[16]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[15]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[14]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[13]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[12]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[11]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[10]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[9]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[8]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[7]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[6]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[5]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[4]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[3]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[2]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[1]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rdata[0]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rresp[1]}]
set_load -pin_load 0.0334 [get_ports {s_axil_rresp[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i2c_scl_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i2c_sda_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_arvalid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_awvalid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_bready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_rready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wvalid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_araddr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_araddr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_araddr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_araddr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_arprot[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_arprot[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_arprot[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_awaddr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_awaddr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_awaddr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_awaddr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_awprot[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_awprot[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_awprot[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wstrb[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wstrb[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wstrb[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axil_wstrb[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 16.0000 [current_design]
